balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ16GS504.PIC
        <edc:SFRDef edc:access="--nnnnnnnnnnnnnn" edc:cname="PORTC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--xxxxxxxxxxxxxx" edc:name="PORTC" edc:nzwidth="0x10" edc:por="--xxxxxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC0" edc:desc="" edc:mask="0x1" edc:name="RC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1" edc:desc="" edc:mask="0x1" edc:name="RC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC2" edc:desc="" edc:mask="0x1" edc:name="RC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC3" edc:desc="" edc:mask="0x1" edc:name="RC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4" edc:desc="" edc:mask="0x1" edc:name="RC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5" edc:desc="" edc:mask="0x1" edc:name="RC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6" edc:desc="" edc:mask="0x1" edc:name="RC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7" edc:desc="" edc:mask="0x1" edc:name="RC7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC8" edc:desc="" edc:mask="0x1" edc:name="RC8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC9" edc:desc="" edc:mask="0x1" edc:name="RC9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC10" edc:desc="" edc:mask="0x1" edc:name="RC10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC11" edc:desc="" edc:mask="0x1" edc:name="RC11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC12" edc:desc="" edc:mask="0x1" edc:name="RC12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC13" edc:desc="" edc:mask="0x1" edc:name="RC13" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="RC" edc:desc="" edc:mask="0xffff" edc:name="RC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnnnnnnnnn" edc:cname="LATC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00000000000000" edc:name="LATC" edc:nzwidth="0x10" edc:por="--00000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="LATC0" edc:desc="" edc:mask="0x1" edc:name="LATC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC1" edc:desc="" edc:mask="0x1" edc:name="LATC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC2" edc:desc="" edc:mask="0x1" edc:name="LATC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC3" edc:desc="" edc:mask="0x1" edc:name="LATC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC4" edc:desc="" edc:mask="0x1" edc:name="LATC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC5" edc:desc="" edc:mask="0x1" edc:name="LATC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC6" edc:desc="" edc:mask="0x1" edc:name="LATC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC7" edc:desc="" edc:mask="0x1" edc:name="LATC7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC8" edc:desc="" edc:mask="0x1" edc:name="LATC8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC9" edc:desc="" edc:mask="0x1" edc:name="LATC9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC10" edc:desc="" edc:mask="0x1" edc:name="LATC10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC11" edc:desc="" edc:mask="0x1" edc:name="LATC11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC12" edc:desc="" edc:mask="0x1" edc:name="LATC12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LATC13" edc:desc="" edc:mask="0x1" edc:name="LATC13" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="LATC" edc:desc="" edc:mask="0xffff" edc:name="LATC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnnnnnnnnn" edc:cname="ODCC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00000000000000" edc:name="ODCC" edc:nzwidth="0x10" edc:por="--00000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ODCC0" edc:desc="" edc:mask="0x1" edc:name="ODCC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC1" edc:desc="" edc:mask="0x1" edc:name="ODCC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCC2" edc:desc="" edc:mask="0x1" edc:name="ODCC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCC3" edc:desc="" edc:mask="0x1" edc:name="ODCC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC4" edc:desc="" edc:mask="0x1" edc:name="ODCC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC5" edc:desc="" edc:mask="0x1" edc:name="ODCC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC6" edc:desc="" edc:mask="0x1" edc:name="ODCC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC7" edc:desc="" edc:mask="0x1" edc:name="ODCC7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC8" edc:desc="" edc:mask="0x1" edc:name="ODCC8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC9" edc:desc="" edc:mask="0x1" edc:name="ODCC9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCC10" edc:desc="" edc:mask="0x1" edc:name="ODCC10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ODCC11" edc:desc="" edc:mask="0x1" edc:name="ODCC11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC12" edc:desc="" edc:mask="0x1" edc:name="ODCC12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ODCC13" edc:desc="" edc:mask="0x1" edc:name="ODCC13" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="SIM.0">
              <edc:SFRFieldDef edc:cname="ODCC" edc:desc="" edc:mask="0xffff" edc:name="ODCC" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="40"/>
        <edc:SFRDef edc:access="n-nn-n-nnnnn-nnn" edc:cname="ADCON" edc:desc="" edc:impl="0xa3ef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0---00000--000" edc:name="ADCON" edc:nzwidth="0x10" edc:por="0-00-0-00000-000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCS" edc:desc="" edc:mask="0x7" edc:name="ADCS" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ASYNCSAMP" edc:desc="" edc:mask="0x1" edc:name="ASYNCSAMP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEQSAMP" edc:desc="" edc:mask="0x1" edc:name="SEQSAMP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORDER" edc:desc="" edc:mask="0x1" edc:name="ORDER" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EIE" edc:desc="" edc:mask="0x1" edc:name="EIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FORM" edc:desc="" edc:mask="0x1" edc:name="FORM" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GSWTRG" edc:desc="" edc:mask="0x1" edc:name="GSWTRG" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SLOWCLK" edc:desc="" edc:mask="0x1" edc:name="SLOWCLK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADSIDL" edc:desc="" edc:mask="0x1" edc:name="ADSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADON" edc:desc="" edc:mask="0x1" edc:name="ADON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ADCS0" edc:desc="" edc:mask="0x1" edc:name="ADCS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCS1" edc:desc="" edc:mask="0x1" edc:name="ADCS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCS2" edc:desc="" edc:mask="0x1" edc:name="ADCS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
          <edc:FreezeBit edc:freezeval="1" edc:name="ADC 1" edc:pos="0xe"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnnnnnnnnnn" edc:cname="ADPCFG" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----000000000000" edc:name="ADPCFG" edc:nzwidth="0x10" edc:por="----000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PCFG0" edc:desc="" edc:mask="0x1" edc:name="PCFG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG1" edc:desc="" edc:mask="0x1" edc:name="PCFG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG2" edc:desc="" edc:mask="0x1" edc:name="PCFG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG3" edc:desc="" edc:mask="0x1" edc:name="PCFG3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG4" edc:desc="" edc:mask="0x1" edc:name="PCFG4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG5" edc:desc="" edc:mask="0x1" edc:name="PCFG5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG6" edc:desc="" edc:mask="0x1" edc:name="PCFG6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG7" edc:desc="" edc:mask="0x1" edc:name="PCFG7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG8" edc:desc="" edc:mask="0x1" edc:name="PCFG8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG9" edc:desc="" edc:mask="0x1" edc:name="PCFG9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG10" edc:desc="" edc:mask="0x1" edc:name="PCFG10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PCFG11" edc:desc="" edc:mask="0x1" edc:name="PCFG11" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="---------nnnnnnn" edc:cname="ADSTAT" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------0000000" edc:name="ADSTAT" edc:nzwidth="0x10" edc:por="---------0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="P0RDY" edc:desc="" edc:mask="0x1" edc:name="P0RDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P1RDY" edc:desc="" edc:mask="0x1" edc:name="P1RDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2RDY" edc:desc="" edc:mask="0x1" edc:name="P2RDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P3RDY" edc:desc="" edc:mask="0x1" edc:name="P3RDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P4RDY" edc:desc="" edc:mask="0x1" edc:name="P4RDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P5RDY" edc:desc="" edc:mask="0x1" edc:name="P5RDY" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P6RDY" edc:desc="" edc:mask="0x1" edc:name="P6RDY" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnn-" edc:cname="ADBASE" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000000000000-" edc:name="ADBASE" edc:nzwidth="0x10" edc:por="000000000000000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADBASE" edc:desc="" edc:islanghidden="true" edc:mask="0x7fff" edc:name="ADBASE" edc:nzwidth="0xf"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
