balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ16GS504.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnn---" edc:cname="PWMCAP4" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000---" edc:name="PWMCAP4" edc:nzwidth="0x10" edc:por="0000000000000---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="PWMCAP4" edc:desc="" edc:islanghidden="true" edc:mask="0x1fff" edc:name="PWMCAP4" edc:nzwidth="0xd"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn----nnnnnn" edc:cname="LEBCON4" edc:desc="" edc:impl="0xffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000----000000" edc:name="LEBCON4" edc:nzwidth="0x10" edc:por="000000----000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LEB" edc:desc="" edc:mask="0x7f" edc:name="LEB" edc:nzwidth="7"/>
              <edc:SFRFieldDef edc:cname="CLLEBEN" edc:desc="" edc:mask="0x1" edc:name="CLLEBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTLEBEN" edc:desc="" edc:mask="0x1" edc:name="FLTLEBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLF" edc:desc="" edc:mask="0x1" edc:name="PLF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLR" edc:desc="" edc:mask="0x1" edc:name="PLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHF" edc:desc="" edc:mask="0x1" edc:name="PHF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHR" edc:desc="" edc:mask="0x1" edc:name="PHR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LEB0" edc:desc="" edc:mask="0x1" edc:name="LEB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB1" edc:desc="" edc:mask="0x1" edc:name="LEB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB2" edc:desc="" edc:mask="0x1" edc:name="LEB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB3" edc:desc="" edc:mask="0x1" edc:name="LEB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB4" edc:desc="" edc:mask="0x1" edc:name="LEB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB5" edc:desc="" edc:mask="0x1" edc:name="LEB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB6" edc:desc="" edc:mask="0x1" edc:name="LEB6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:AdjustPoint edc:offset="160"/>
        <edc:SFRDef edc:access="n-n----nnnn-n-nn" edc:cname="CMPCON1" edc:desc="" edc:impl="0xffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-0----0000-0-00" edc:name="CMPCON1" edc:nzwidth="0x10" edc:por="0-0----0000-0-00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RANGE" edc:desc="" edc:mask="0x1" edc:name="RANGE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CMPPOL" edc:desc="" edc:mask="0x1" edc:name="CMPPOL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CMPSTAT" edc:desc="" edc:mask="0x1" edc:name="CMPSTAT" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXTREF" edc:desc="" edc:mask="0x1" edc:name="EXTREF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INSEL" edc:desc="" edc:mask="0x3" edc:name="INSEL" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="CMPSIDL" edc:desc="" edc:mask="0x1" edc:name="CMPSIDL" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CMPON" edc:desc="" edc:mask="0x1" edc:name="CMPON" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="INSEL0" edc:desc="" edc:mask="0x1" edc:name="INSEL0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INSEL1" edc:desc="" edc:mask="0x1" edc:name="INSEL1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="CMPDAC1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------000000000" edc:name="CMPDAC1" edc:nzwidth="0x10" edc:por="-------000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMREF" edc:desc="" edc:mask="0x3ff" edc:name="CMREF" edc:nzwidth="0xa"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CMREF0" edc:desc="" edc:mask="0x1" edc:name="CMREF0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF1" edc:desc="" edc:mask="0x1" edc:name="CMREF1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF2" edc:desc="" edc:mask="0x1" edc:name="CMREF2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF3" edc:desc="" edc:mask="0x1" edc:name="CMREF3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF4" edc:desc="" edc:mask="0x1" edc:name="CMREF4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF5" edc:desc="" edc:mask="0x1" edc:name="CMREF5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF6" edc:desc="" edc:mask="0x1" edc:name="CMREF6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF7" edc:desc="" edc:mask="0x1" edc:name="CMREF7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF8" edc:desc="" edc:mask="0x1" edc:name="CMREF8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMREF9" edc:desc="" edc:mask="0x1" edc:name="CMREF9" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
